import type { lyric } from '@/types/songlist';

//歌詞測試
// let arr = "[00:00.000] 作词 : たか坊\n[00:01.000] 作曲 : たか坊\n[00:15:59]どうしようもないくらい\n[00:17:65]だらしないセカイは\n[00:19:48]嘲笑う悪魔のようで\n[00:23:01]いつの間にか歌う魔法\n[00:26:16]踊るビビデバビデブー\n[00:28:23]頭右左に振る yeah\n[00:30:45]でもそんなくだらないこと\n[00:32:13]願いを込めて呟いたって\n[00:33:94]もう何を信じても\n[00:35:71]頭抱える人間\n[00:37:87]よくもまぁ、\n[00:38:92]平気な顔で嘘を付くよね\n[00:41:67]『僕たち今良い人生なんです』\n[00:43:62]なんて言っちゃって\n[00:45:36]変わる時代に飲み込まれて\n[00:49:09]回るラルラリラ ラリラ\n[00:52:70]甘い甘い幻想にイカれた\n[00:56:65]\"今\"何が正解かわかんなくて\n[00:59:92]ゆらゆら〜\n[01:06:71]東京イリュージョン\n[01:08:64]稼ぎなんてなくても\n[01:11:17]Stay Gold\n[01:12:36]今も書き続ける\n[01:14:60]My Life Song\n[01:15:93]無駄な成功よりも\n[01:18:32]眠らない街で夢を見るんだ\n[01:21:81]Oh yeah…\n[01:23:24]馬鹿騒ぎして\n[01:25:47]Walk this way\n[01:26:90]今もまだ止まらずに\n[01:29:70]描くノンフィクション\n[01:31:41]誰もノーリアクション\n[01:33:25]今はそれでいい\n[01:34:56]死ぬまでずっと探してるんだ\n[01:44:38]マジでうぜぇ…\n[01:45:68]不平、不満、不幸なこのセカイじゃ\n[01:48:00]優越感なんて浸り足りねぇんだ\n[01:50:87]まだ夜に輝く六本木\n[01:52:80]人混み合うスクランブルもそう\n[01:54:94]誰も眠らぬ新宿だって\n[01:56:67]マジくそみてぇに腐ってる\n[01:59:34]待ち焦がれていた街は\n[02:00:99]荒波に漂ったゴミだ\n[02:02:96]現実は身も蓋も無いし\n[02:04:61]未来なんて元も子もないね yeah…\n[02:06:63]曖昧で半端な夢想家\n[02:08:27]なんとなく大人になって変わった？\n[02:10:26]我慢したっていつもギリギリだ\n[02:11:91]それならいっそ死んだ方がマシだ\n[02:14:90]東京イリュージョン\n[02:16:73]稼ぎなんてなくても\n[02:19:31]Stay Gold\n[02:20:48]今も書き続ける\n[02:22:86]My Life Song\n[02:24:21]無駄な成功よりも\n[02:26:54]眠らない街で夢を見るんだ\n[02:29:90]Oh yeah…\n[02:31:72]馬鹿騒ぎして\n[02:33:54]Walk this way\n[02:35:21]今もまだ止まらずに\n[02:38:03]描くノンフィクション\n[02:40:08]誰もノーリアクション\n[02:41:55]今はそれでいい\n[02:43:00]死ぬまでずっと探してるんだ\n[02:45:21]誰もが何かを求めるけど\n[02:52:62]変わらない\n[02:55:51]ゆらり揺られ\n[02:57:54]流されてしまうから\n[03:00:02]誰もが\n[03:02:63]なんとなく抱えてる無名の悩みも\n[03:07:26]最後まで満たされることない\n[03:11:00]それもきっと\n[03:12:76]答えだと信じて\n[03:18:16]タバコの煙もただ溶けていく\n[03:21:59]東京イリュージョン\n[03:23:40]稼ぎなんてなくても\n[03:25:94]Stay Gold\n[03:27:14]今も書き続ける\n[03:29:30]My Life Song\n[03:30:76]無駄な成功よりも\n[03:33:09]眠らない街で夢を見るんだ\n[03:36:57]Oh yeah…\n[03:38:10]馬鹿騒ぎして\n[03:40:10]Walk this way\n[03:41:75]今もまだ止まらずに\n[03:44:21]描くノンフィクション\n[03:46:25]誰もノーリアクション\n[03:48:00]今はそれでいい\n[03:49:37]死ぬまでずっと笑っているんだ\n";
// let arr = "[00:14.00][02:57.00][03:33.00]<ひなた>\n[00:14.01][01:25.14][03:33.13]君が好きだよ\n[00:16.01][01:26.96][03:35.13]驚かせて\n[00:17.60][01:28.51]ごめんねって\n[00:19.36][01:30.32]私じゃダメなの？\n[00:21.00][01:25.00][03:40.00]<杏梨>\n[00:21.50][01:32.33][01:46.49][02:57.63][03:40.31][03:54.55][04:08.80]友達以上恋人じゃない\n[00:24.67][01:50.05][03:43.83]君の気持ちが知りたいよ\n[00:42.00]<鈴音、杏梨、ゆきな>\n[00:42.14]君とあの日逢った時から\n[00:49.30]胸の奥がチクリと痛む\n[00:56.00][01:03.00]<ひなた、ほたる>\n[00:56.79]逢えなくなるならこのまま\n[01:00.22]友達でもいや良くない\n[01:03.80][02:29.22]君に目で送るテレパシー\n[01:06.86]届きますように\n[01:10.06]このままじゃ　we don't stop　終われない\n[01:14.48][02:39.69]光の先を行け\n[01:18.02][02:43.29]ほらノック ノック ノック\n[01:21.58][02:45.15]新しい扉の向こうで逢いましょう\n[01:32.00][02:50.00][03:05.00]<鈴音>\n[01:35.85]君のことしか見えないよ\n[01:39.00][03:12.00]<ほたる>\n[01:39.41][02:50.47][03:47.46]誰が好きなの？私を見て\n[01:42.96][02:54.02][03:50.94]わがままだってあんまり言わない\n[01:46.00][03:09.00]<ゆきな>\n[02:07.00][03:47.00][04:01.00]<杏梨、ほたる>\n[02:07.79]あの子君に話しかけすぎ\n[02:14.77]胸の奥のチクリが消えない\n[02:22.00][02:29.00][03:54.00]<鈴音、ゆきな、ひなた>\n[02:22.13]関係ないけど気になる\n[02:25.57]つい横目で追いかけちゃう\n[02:32.69]気付かないのに\n[02:35.44]このままじゃ　we don'tchange　変われない\n[03:01.11]君の気持ちが聞きたいよ\n[03:05.78]いつか二人で\n[03:09.18]星に願いを\n[03:12.28]祈ろう\n[03:13.00]<鈴音、ゆきな、ほたる>\n[03:13.99]このままずっと寄り添えますように\n[03:36.70]ごめんねって私じゃダメなの？\n[03:58.08]君のことしか見てないよ\n[04:01.61]君は何故まだ気付かないの\n[04:05.18]可愛いあの子に取られる前に\n[04:12.28]君の気持ちが知りたいよ...\n";
// let tc = [] as lyric[];

const LYRIC = (LC: string, Lyric: lyric[]): boolean => {
  if (LC === '') return false;
  //轉換成對象
  const lyricarr = LC.split(/\n/);
  //時間/g轉換為數組
  const regtime2 = /\d{2}:\d{2}.\d{2,3}/g;

  const formatLyricTime = (time: any) => {
    const regMin = /\d{2}/;
    const regSec = /(?<=:)\d{2}/;
    const regMs = /\d{2,3}$/;

    const min = parseInt(time.match(regMin)[0]);
    let sec = parseInt(time.match(regSec)[0]);
    const ms = time.match(regMs);
    
    if (min !== 0) {
      sec += min * 60;
    }
    return Number(sec + '.' + ms);
  };

  lyricarr.forEach(p => {
    //提取時間
    const arrtime = p.match(regtime2);
    //如果有第一項
    if (arrtime) {
      const time = formatLyricTime(arrtime[0]) || 0;
      const strlyric = p.substr(p.lastIndexOf(']') + 1);
      Lyric.push({
        time: time,
        lyric: strlyric
      });
      //如果有第二項
      if (arrtime[1]) {
        const time = formatLyricTime(arrtime[1]) || 0;
        const strlyric = p.substr(p.lastIndexOf(']') + 1);
        Lyric.push({
          time: time,
          lyric: strlyric
        });
      }
      //如果有第三項
      if (arrtime[2]) {
        const time = formatLyricTime(arrtime[2]) || 0;
        const strlyric = p.substr(p.lastIndexOf(']') + 1);
        Lyric.push({
          time: time,
          lyric: strlyric
        });
      }
    }
  });

  Lyric.sort((p, s) => p.time - s.time);
  return true;
};
// console.log(LYRIC(arr, tc));
// console.log(tc);



export default LYRIC; 